# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples*4

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(perimetery)
"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07

# У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
# Скільки всього дерев посадили в саду?
apples = 4
pears = apples + 5
plums = apples - 2
all_trees = apples + pears + plums

print("Відповідь:\nУ саду посадили яблунь: ", apples, "\nГруш на 5 більше яблунь: ", apples, "+", 5, "=", pears, "\nСлив на 2 менше яблунь: ", apples, "-", 2, "=", plums, "\nА всього дерев посадили: ", apples, "+", pears, "+", plums, "=", all_trees)

# task 08
# До обіда температура повітря була на 5 градусів вище нуля.
# Після обіду температура опустилася на 10 градусів.
# Надвечір потепліло на 4 градуси. Яка температура надвечір?

temp_before_afternoon = 5
temp_after_afternoon = temp_before_afternoon - 10
temp_evening = temp_after_afternoon + 4

print("Відповідь:\nДо обіду температура повітря була: ", temp_before_afternoon, "\nПісля обіду температура опустилася на 10 градусів: ", temp_before_afternoon, "-", 10, "=", temp_after_afternoon, "\nНадвечір потепліло на 4 градуси: ", temp_after_afternoon, "+", 4, "=", temp_evening)
# task 09
# Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
# 1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
# Скількі сьогодні дітей у театральному гуртку?

boys = 24
girls = boys//2
boys_sick = 1
girls_absent = 2

print("Відповідь:\nВзагалі у театральному гуртку хлопчиків: ", boys, "\nА дівчаток - вдвічі менше: ", boys, ":", 2, "=", girls, "\nХлопчиків захворіло: ", boys_sick, "\nДівчинок не прийшло: ", girls_absent, "\nТобто сьогодні у садку: ", boys, "+", girls, "-", boys_sick, "-", girls_absent, "=", (boys + girls - boys_sick - girls_absent))

# task 10
# Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
# а третя - як половина вартості першої та другої разом.
# Скільки будуть коштувати усі книги, якщо купити по одному примірнику?

book_1 = 8
book_2 = book_1 + 2
book_3 = (book_1 + book_2)//2
all = book_1 + book_2 + book_3

print("Відповідь:\nПерша книжка коштує: ", book_1, "грн", "\nДруга на 2 грн дорожче: ", book_1, "+", 2, "=", book_2, "грн", "\nА третя - як половина вартості першої та другої разом.: ", "(", book_1, "+", book_2, ")", "/", 2, "=", book_3, "грн", "\nУсі книги, якщо купити по одному примірнику будуть коштувати: ", book_1, "+", book_2, "+", book_3, "=", all, "грн")

