alice_in_wonderland = ('"Would you tell me, please, which way I ought to go from here?"\n'
                       '"That depends a good deal on where you want to get to," said the Cat.\n'
                       '"I don\'t much care where ——" said Alice.\n'
                       '"Then it doesn\'t matter which way you go," said the Cat.\n'
                       '"—— so long as I get somewhere," Alice added as an explanation.\n'
                       '"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."')
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк
print(alice_in_wonderland)


"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea_area = 436402
azov_sea_area = 37800
all_sea_area = black_sea_area + azov_sea_area

print(f'Task 04 - Відповідь: '
      f'\nПлоща Чорного та Азовського моря разом займає: {black_sea_area} км2 + {azov_sea_area} км2 = {all_sea_area} км2')

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
all_products = 375291
warehouse_01_02 = 250449
warehouse_02_03 = 222950
warehouse_03 = all_products - warehouse_01_02
warehouse_01 = all_products - warehouse_02_03
warehouse_02 = all_products - (warehouse_01 + warehouse_03)

print(f'Task 05 - Відповідь: '
      f'\nЩоб знайти кількість товарів на третьому складі треба від загальної кількості відняти кількість товарів 1-го і 2-го разом: {all_products} - {warehouse_01_02} = {warehouse_03}'
      f'\nЩоб знайти кількість товарів на першому складі треба від загальної кількості відняти кількість товарів 2-го і 3-го разом: {all_products} - {warehouse_02_03} = {warehouse_01}'
      f'\nЩоб знайти кількість товарів на другому складі треба від загальної кількості відняти кількість товарів 1-го і 2-го разом, які ми вже знайшли: {all_products} - ({warehouse_01} + {warehouse_03}) = {warehouse_02}')

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
monthly_payment = 1179
all_months = 18
pc_price = monthly_payment * all_months

print(f'Task 06 - Відповідь: '
      f'\nВартість комп\'ютера буде дорівнювати вартості місячного платіжа помноженої на кількість всіх місяців(18): {monthly_payment} * {all_months} = {pc_price} грн')

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
a = 8019 % 8
b = 9907 % 9
c = 2789 % 5
d = 7248 % 6
e = 7128 % 5
f = 19224 % 9
print(f'Task 07 - Відповідь: '
      f'\na) {a}, b) {b}, c) {c}, d) {d}, e) {e}, f) {f}')

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""

pizza_big = 274
pizza_medium = 218
juice = 35
cake = 350
water = 21

order_price = pizza_big*4 + pizza_medium*2 + juice*4 + cake*1 + water*3
print(f'Task 08 - Відповідь: '
      f'\nЩоб отримати загальну вартість замовлення треба помножити ціну кожного товара на його кількість та скласти результати кожного множення:'
      f'\nЗагальна вартість = ({pizza_big}*4 + {pizza_medium}*2 + {juice}*4 + {cake}*1 + {water}*3) = {order_price}' )

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
all_photos = 232
page_photos = 8
pages = all_photos // page_photos
print(f'Task 09 - Відповідь: '
      f'\nЩоб отримати кількість сторінок, що знадобляться, потрібно кількість всіх фото розділити на кількість сторінок, що можуть бути розміщені на одній сторінці:'
      f'\nКількість сторінок = {all_photos} / {page_photos} = {pages}')

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
distance = 1600
fuel_for_100_km = 9
fuel_tank = 48
fuel_for_trip = distance // 100 * fuel_for_100_km
gas_stops = fuel_for_trip // fuel_tank
print(f'Task 10 - Відповідь: '
      f'\nЩоб отримати кількість літрів, що знадобляться, потрібно всю дистанцію розділити на 100 км щоб дізнатися скількі сотень км потрібно буде подолати, і цю кількість помножити на кількість літрів, необхідних на сотню:'
      f'\nБензин на подорож = {distance} / 100 * {fuel_for_100_km} = {fuel_for_trip} км'
      f'\nЩоб знати скільки разів треба буде заїхати на заправку треба кількість літрів на всю подорож розділити на місткість баку:'
      f'\nКількість зупинок для заправки: {fuel_for_trip} / {fuel_tank} = {gas_stops} рази')

